[
  {
    "Section": "Economy",
    "text": "Trump took office at the height of the longest economic expansion in American history, which began in June 2009 and continued until February 2020, when the COVID-19 recession began.\n\nIn December 2017, Trump signed the Tax Cuts and Jobs Act of 2017. The bill had been passed by both Republican-controlled chambers of Congress without any Democratic votes. It reduced tax rates for businesses and individuals, with business tax cuts to be permanent and individual tax cuts set to expire after 2025, and eliminated the penalty associated with Affordable Care Act's individual mandate. The Trump administration claimed that the act would either increase tax revenues or pay for itself by prompting economic growth. Instead, revenues in 2018 were 7.6 percent lower than projected.\n\nDespite a campaign promise to eliminate the national debt in eight years, Trump approved large increases in government spending and the 2017 tax cut. As a result, the federal budget deficit increased by almost 50 percent, to nearly $1 trillion in 2019. Under Trump, the U.S. national debt increased by 39 percent, reaching $27.75 trillion by the end of his term, and the U.S. debt-to-GDP ratio hit a post-World War II high. Trump also failed to deliver the $1 trillion infrastructure spending plan on which he had campaigned.\n\nTrump is the only modern U.S. president to leave office with a smaller workforce than when he took office, by 3 million people."
  },
  {
    "Section": "Climate Change, Environment, and Energy",
    "text": "Trump rejects the scientific consensus on climate change. He reduced the budget for renewable energy research by 40 percent and reversed Obama-era policies directed at curbing climate change. In June 2017, Trump announced the withdrawal of the United States from the Paris Agreement, making the U.S. the only nation in the world to not ratify the agreement.\n\nTrump aimed to boost the production and exports of fossil fuels. Natural gas expanded under Trump, but coal continued to decline. Trump rolled back more than 100 federal environmental regulations, including those that curbed greenhouse gas emissions, air and water pollution, and the use of toxic substances. He weakened protections for animals and environmental standards for federal infrastructure projects, and expanded permitted areas for drilling and resource extraction, such as allowing drilling in the Arctic Refuge. Trump's actions while president have been called \"a very aggressive attempt to rewrite our laws and reinterpret the meaning of environmental protections\"."
  },
  {
    "Section": "Deregulation",
    "text": "In January 2017, Trump signed Executive Order 13771, which directed that, for every new regulation, federal agencies \"identify\" two existing regulations for elimination, though it did not require elimination. He dismantled many federal regulations on health, labor, and the environment, among other topics. Trump signed 14 Congressional Review Act resolutions repealing federal regulations, including a bill that made it easier for severely mentally ill persons to buy guns. During his first six weeks in office, he delayed, suspended, or reversed ninety federal regulations, often \"after requests by the regulated industries\". The Institute for Policy Integrity found that 78 percent of Trump's proposals were blocked by courts or did not prevail over litigation."
  },
  {
    "Section": "Health Care",
    "text": "During his campaign, Trump vowed to repeal and replace the Affordable Care Act (ACA). In office, he scaled back the Act's implementation through executive orders 13765 and 13813. Trump expressed a desire to \"let Obamacare fail\"; his administration cut the ACA enrollment period in half and drastically reduced funding for advertising and other ways to encourage enrollment. Trump falsely claimed he saved the coverage of pre-existing conditions provided by the ACA. In June 2018, the Trump administration joined 18 Republican-led states in arguing before the Supreme Court that the elimination of the financial penalties associated with the individual mandate had rendered the ACA unconstitutional. If they had succeeded, it would have eliminated health insurance coverage for up to 23 million Americans. During the 2016 campaign, Trump promised to protect funding for Medicare and other social safety-net programs, but in January 2020, he suggested he was willing to consider cuts to such programs.\n\nIn response to the opioid epidemic, Trump signed legislation in 2018 to increase funding for drug treatments but was widely criticized for failing to make a concrete strategy. U.S. opioid overdose deaths declined slightly in 2018 but surged to a record 50,052 deaths in 2019."
  },
  {
    "Section": "Social Issues",
    "text": "Trump barred organizations that provide abortions or abortion referrals from receiving federal funds. He said he supported \"traditional marriage\" but considered the nationwide legality of same-sex marriage a \"settled\" issue. In March 2017, his administration rolled back key components of the Obama administration's workplace protections against discrimination of LGBT people. Trump's attempted rollback of anti-discrimination protections for transgender patients in August 2020 was halted by a federal judge after the Supreme Court's ruling in July had extended employees' civil rights protections to gender identity and sexual orientation.\n\nTrump has said he is opposed to gun control in general, although his views have shifted over time. After several mass shootings during his term, he said he would propose legislation related to guns, but he abandoned that effort in November 2019. His administration took an anti-marijuana position, revoking Obama-era policies that provided protections for states that legalized marijuana.\n\nTrump is a long-time advocate of capital punishment. Under his administration, the federal government executed 13 prisoners, more than in the previous 56 years combined and after a 17-year moratorium. In 2016, Trump said he supported the use of interrogation torture methods such as waterboarding but later appeared to recant this due to the opposition of Defense Secretary James Mattis."
  },
  {
    "Section": "Pardons and Commutations",
    "text": "Further information: List of people granted executive clemency by Donald Trump\n\nTrump granted 237 requests for clemency, fewer than all presidents since 1900 with the exception of George H. W. Bush and George W. Bush. Only 25 of them had been vetted by the Justice Department's Office of the Pardon Attorney; the others were granted to people with personal or political connections to him, his family, and his allies, or recommended by celebrities.\n\nFrom 2017 to 2019, he pardoned, amongst others, former Navy sailor Kristian Saucier, who was convicted of taking classified photographs of classified areas inside a submarine; and right-wing commentator Dinesh D'Souza. Following a request by celebrity Kim Kardashian, Trump commuted the life sentence of Alice Marie Johnson, who had been convicted of drug trafficking. Trump also pardoned or reversed the sentences of three American servicemen convicted or accused of committing war crimes in Afghanistan or Iraq.\n\nIn November and December 2020, Trump pardoned four Blackwater private security contractors convicted of killing Iraqi civilians in the 2007 Nisour Square massacre; white-collar criminals Michael Milken and Bernard Kerik; daughter Ivanka's father-in-law Charles Kushner; and five people convicted as a result of investigations into Russian interference in the 2016 presidential elections. Among them were Michael Flynn; Roger Stone, whose 40-month sentence for lying to Congress, witness tampering, and obstruction he had already commuted in July; and Paul Manafort.\n\nIn his last full day in office, Trump granted 73 pardons, including to Steve Bannon and Trump fundraiser Elliott Broidy, and commuted 70 sentences."
  },
  {
    "Section": "Lafayette Square Protester Removal and Photo Op",
    "text": "On June 1, 2020, during the George Floyd protests, federal law-enforcement officials used batons, rubber bullets, pepper spray projectiles, stun grenades, and smoke to remove a largely peaceful crowd of protesters from Lafayette Square, outside the White House. Trump then walked to St. John's Episcopal Church, where protesters had set a small fire the night before; he posed for photographs holding a Bible, with senior administration officials later joining him in photos. Trump said on June 3 that the protesters were cleared because \"they tried to burn down the church [on May 31] and almost succeeded\", describing the church as \"badly hurt\".\n\nReligious leaders condemned the treatment of protesters and the photo opportunity itself. Many retired military leaders and defense officials condemned Trump's proposal to use the U.S. military against anti-police-brutality protesters."
  },
  {
    "Section": "Immigration",
    "text": "Trump's proposed immigration policies were a topic of bitter and contentious debate during the campaign. He promised to build a wall on the Mexico–United States border to restrict illegal movement and vowed Mexico would pay for it. He pledged to deport millions of illegal immigrants residing in the United States, and criticized birthright citizenship for incentivizing \"anchor babies\". As president, he frequently described illegal immigration as an \"invasion\" and conflated immigrants with the criminal gang MS-13, though available research shows undocumented immigrants have a lower crime rate than native-born Americans.\n\nTrump attempted to drastically escalate immigration enforcement, including implementing harsher immigration enforcement policies against asylum seekers from Central America than any modern U.S. president.\n\nFrom 2018 onward, Trump deployed nearly 6,000 troops to the U.S.–Mexico border to stop most Central American migrants from seeking U.S. asylum. In 2020, his administration widened the public charge rule to further restrict immigrants who might use government benefits from getting permanent residency via green cards. Trump reduced the number of refugees admitted into the U.S. to record lows. When Trump took office, the annual limit was 110,000; Trump set a limit of 18,000 in the 2020 fiscal year and 15,000 in the 2021 fiscal year. Additional restrictions implemented by the Trump administration caused significant bottlenecks in processing refugee applications, resulting in fewer refugees accepted compared to the allowed limits."
  },
  {
    "Section": "Travel Ban",
    "text": "Following the 2015 San Bernardino attack, Trump proposed to ban Muslim foreigners from entering the United States until stronger vetting systems could be implemented. He later reframed the proposed ban to apply to countries with a \"proven history of terrorism\".\n\nOn January 27, 2017, Trump signed Executive Order 13769, which suspended admission of refugees for 120 days and denied entry to citizens of Iraq, Iran, Libya, Somalia, Sudan, Syria, and Yemen for 90 days, citing security concerns. The order took effect immediately and without warning, causing confusion and chaos at airports. Protests against the ban began at airports the next day. Legal challenges to the order resulted in nationwide preliminary injunctions. A March 6 revised order, which excluded Iraq and gave other exemptions, again was blocked by federal judges in three states. In a decision in June 2017, the Supreme Court ruled that the ban could be enforced on visitors who lack a \"credible claim of a bona fide relationship with a person or entity in the United States\".\n\nThe temporary order was replaced by Presidential Proclamation 9645 on September 24, 2017, which restricted travel from the originally targeted countries except Iraq and Sudan, and further banned travelers from North Korea and Chad, along with certain Venezuelan officials. After lower courts partially blocked the new restrictions, the Supreme Court allowed the September version to go into full effect on December 4, 2017, and ultimately upheld the travel ban in a June 2019 ruling."
  },
  {
    "Section": "Family Separation at Border",
    "text": "The Trump administration separated more than 5,400 children of migrant families from their parents at the U.S.–Mexico border, a sharp increase in the number of family separations at the border starting from the summer of 2017. In April 2018, the Trump administration announced a \"zero tolerance\" policy whereby every adult suspected of illegal entry would be criminally prosecuted. This resulted in family separations, as the migrant adults were put in criminal detention for prosecution, while their children were separated as unaccompanied alien minors. Administration officials described the policy as a way to deter illegal immigration.\n\nThe policy of family separations was unprecedented in previous administrations and sparked public outrage. Trump falsely asserted that his administration was merely following the law, blaming Democrats, despite the separations being his administration's policy.\n\nAlthough Trump originally argued that the separations could not be stopped by an executive order, he acceded to intense public objection and signed an executive order on June 20, 2018, mandating that migrant families be detained together unless \"there is a concern\" doing so would pose a risk to the child. On June 26, 2018, Judge Dana Sabraw concluded that the Trump administration had \"no system in place to keep track of\" the separated children, nor any effective measures for family communication and reunification; Sabraw ordered for the families to be reunited and family separations stopped except in limited circumstances. After the federal-court order, the Trump administration separated more than a thousand migrant children from their families; the ACLU contended that the Trump administration had abused its discretion and asked Sabraw to more narrowly define the circumstances warranting separation."
  },
  {
    "Section": "Trump Wall and Government Shutdown",
    "text": "One of Trump's central campaign promises was to build a 1,000-mile (1,600 km) border wall to Mexico and have Mexico pay for it. By the end of his term, the U.S. had built \"40 miles [64 km] of new primary wall and 33 miles [53 km] of secondary wall\" in locations where there had been no barriers and 365 miles (587 km) of primary or secondary border fencing replacing dilapidated or outdated barriers.\n\nIn 2018, Trump refused to sign any appropriations bill from Congress unless it allocated $5.6 billion in funds for the border wall, resulting in the federal government partially shutting down for 35 days from December 2018 to January 2019, the longest U.S. government shutdown in history. Around 800,000 government employees were furloughed or worked without pay. Trump and Congress ended the shutdown by approving temporary funding that provided delayed payments to government workers but no funds for the wall. The shutdown resulted in an estimated permanent loss of $3 billion to the economy, according to the Congressional Budget Office. About half of those polled blamed Trump for the shutdown, and Trump's approval ratings dropped.\n\nTo prevent another imminent shutdown in February 2019, Congress passed and Trump signed a funding bill that included $1.375 billion for 55 miles (89 km) of bollard border fencing. Trump also declared a National Emergency Concerning the Southern Border of the United States, intending to divert $6.1 billion of funds Congress had allocated to other purposes. Trump vetoed a joint resolution to overturn the declaration, and the Senate voted against a veto override. Legal challenges to the diversion of $2.5 billion originally meant for the Department of Defense's drug interdiction efforts and $3.6 billion originally meant for military construction were unsuccessful."
  }
]